In [1]:
!pip install pandas

Collecting pandas
  Using cached https://files.pythonhosted.org/packages/b5/ac/5ec0601ce698235cad8559dfe0ae5ace903a359d617a8c4c033f9879faf8/pandas-1.1.5-cp37-cp37m-macosx_10_9_x86_64.whl
Collecting numpy>=1.15.4 (from pandas)
  Downloading https://files.pythonhosted.org/packages/b6/50/ecda32e07ec70235a828dcd8ec32395ef7772120ccbe5a73df9cc3db1090/numpy-1.20.3-cp37-cp37m-macosx_10_9_x86_64.whl (16.0MB)
    100% |████████████████████████████████| 16.0MB 741kB/s ta 0:00:01
Requirement already satisfied: python-dateutil>=2.7.3 in ./venv/lib/python3.7/site-packages (from pandas) (2.8.1)
Collecting pytz>=2017.2 (from pandas)
  Using cached https://files.pythonhosted.org/packages/70/94/784178ca5dd892a98f113cdd923372024dc04b8d40abe77ca76b5fb90ca6/pytz-2021.1-py2.py3-none-any.whl
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: numpy, pytz, pandas
Successfully installed numpy-1.20.3 pandas-1.1.5 pytz-2021.1

In [2]:
import pandas as pd

columns = ['Name', 'Age', 'Height']
df = pd.DataFrame(columns=columns)

df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Allen', '22', '175']
df

    Name Age Height
0  Allen  22    175

In [4]:
df.loc[1] = ['Ted', '25', '180']
df.loc[2] = ['Jack', '29', '190']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  29    190

In [5]:
df['Weight'] = ['75', '80', '85']
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  29    190     85

In [8]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  29    190

In [9]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  29    190     85

In [10]:
df = df.drop(['Weight'], axis=1)

In [11]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  29    190

In [13]:
df.drop(2, axis=0)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [14]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  29    190

In [15]:
df = df.drop(2, axis=0)

In [16]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [17]:
df['Age'][0]

'22'

In [18]:
df['Age'][0] = '23'

In [19]:
df

    Name Age Height
0  Allen  23    175
1    Ted  25    180

In [20]:
df['Age'] = '100'

In [21]:
df

    Name  Age Height
0  Allen  100    175
1    Ted  100    180

In [22]:
df.loc[1] = 'aaa'

In [23]:
df

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa

In [24]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Jack', '29', '77'],
    ['Merry', '23', '70']
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

    Name Age Height
0   Jack  29     77
1  Merry  23     70

In [25]:
df.append(df2)

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa
0   Jack   29     77
1  Merry   23     70

In [26]:
df

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa

In [27]:
df3 = df.append(df2)
df3

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa
0   Jack   29     77
1  Merry   23     70

In [28]:
df3.reset_index()

   index   Name  Age Height
0      0  Allen  100    175
1      1    aaa  aaa    aaa
2      0   Jack   29     77
3      1  Merry   23     70

In [29]:
df3.reset_index(drop=True)

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa
2   Jack   29     77
3  Merry   23     70

In [30]:
df3

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa
0   Jack   29     77
1  Merry   23     70

In [31]:
df3 = df3.reset_index(drop=True)

In [32]:
df3

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa
2   Jack   29     77
3  Merry   23     70

In [33]:
df3['Age']

0    100
1    aaa
2     29
3     23
Name: Age, dtype: object

In [34]:
df3.loc[2]

Name      Jack
Age         29
Height      77
Name: 2, dtype: object

In [35]:
df4 = df3

In [36]:
df4

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa
2   Jack   29     77
3  Merry   23     70

In [37]:
df3

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    aaa
2   Jack   29     77
3  Merry   23     70

In [38]:
df4['Height'][1] = 'bbb'

In [39]:
df4

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    bbb
2   Jack   29     77
3  Merry   23     70

In [40]:
df3

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    bbb
2   Jack   29     77
3  Merry   23     70

In [41]:
df5 = df3.copy()

In [42]:
df5

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    bbb
2   Jack   29     77
3  Merry   23     70

In [43]:
df3

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    bbb
2   Jack   29     77
3  Merry   23     70

In [44]:
df5['Height'][1] = 'ccc'

In [45]:
df5

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    ccc
2   Jack   29     77
3  Merry   23     70

In [46]:
df3

    Name  Age Height
0  Allen  100    175
1    aaa  aaa    bbb
2   Jack   29     77
3  Merry   23     70